//Задача 6
Console.WriteLine("Введите число a: ");
int a = int.Parse(Console.ReadLine());

if ((a % 2) == 0)
{
Console.WriteLine("Число a чётное");
}
else
{
Console.WriteLine("Число а нечётное");  
}